import sqlite3

# (course_id, course_name, teacher_name, credit, course_type, course_quota, remaining_quota, weekday, course_time, lang, class_for)
# weekday用數字加分號的方式, 例如: "1;3", 代表星期一跟星期三
# course_time用逗號與分號的方式, 例如: "2,3,4;7,8", 代表第2,3,4節 跟 7,8節
# 綜合以上的weekday跟course_time, 意思為: 星期一的2,3,4節 跟 星期三的7,8節
# 註: 不要有空格

# predefine_courses = [
#     ("0001", "計算機概論", "Teacher 1", 3, "必修", 60, 60, "1;3"  , "2,3,4;7,8"  , "中文", "資訊一甲"),
#     ("0002", "職場英文"  , "Teacher 2", 3, "選修", 40, 40, "2;4;5", "1;6,7,8;3,4", "英文", "外文一甲"),
#     ("0003", "會計學(一)", "Teacher 3", 3, "必修", 50, 50, "3"    , "6,7,8"      , "中文", "會計一甲"),
#     ("0004", "會計學(二)", "Teacher 3", 3, "必修", 50, 50, "4"    , "2,3,4"      , "中文", "會計二甲"),
#     ("0005", "會計學(二)", "Teacher 3", 3, "必修", 50, 50, "4"    , "6,7,8"      , "中文", "會計二乙"),
#     ("0006", "管理學", "Teacher 4", 3, "選修", 70, 70, "3;4"    , "3,4;9,10"      , "中文", "會計二甲"),
# ]

predefine_courses = [
    ("0001", "計算機概論" , "Teacher 1", 3, "必修", 60, 60, "1;3", "2,3,4;7,8", "中文", "資訊一甲"),
    ("0002", "離散數學", "Teacher 5", 3, "必修", 55, 55, "1;3", "2,3,4;7,8", "中文", "資訊二甲"),
    ("0003", "資料結構", "Teacher 1", 3, "選修", 50, 50, "2;4", "6,7,8;3,4", "英文", "資訊二甲"),
    ("0004", "物件導向程式設計", "Teacher 10", 3, "選修", 50, 50, "1;2", "3,4;9,10", "中文", "資訊二甲"),
    ("0005", "資料庫系統", "Teacher 9", 3, "必修", 60, 60, "2;5", "2,3,4;7,8", "中文", "資訊二甲"),
    ("0006", "演算法設計", "Teacher 6", 3, "必修", 55, 55, "6", "6,7,8", "英文", "資訊二甲"),
    ("0007", "計算機組織", "Teacher 13", 3, "必修", 60, 60, "3;4", "2,3,4;6,7", "英文", "資訊二甲"),
    ("0008", "機器學習概論", "Teacher 8", 3, "選修", 45, 45, "2;4", "3,4;9,10", "英文", "資訊三甲"),
    ("0009", "程式語言原理", "Teacher 10", 3, "必修", 50, 50, "1;4", "3,4;7,8", "中文", "資訊三甲"),
    ("0010", "嵌入式系統", "Teacher 12", 3, "選修", 50, 50, "3;5", "3,4;8,9", "英文", "資訊三乙"),
    ("0011", "人工智慧", "Teacher 8", 3, "選修", 45, 45, "2;5", "7,8;3,4", "中文", "資訊四甲"),
    ("0012", "網路安全", "Teacher 15", 3, "選修", 40, 40, "2;3", "6,7,8;2,3", "英文", "資訊四乙"),

    ("0013", "電子電路", "Teacher 11", 3, "必修", 70, 70, "2;4", "2,3,4;6,7", "中文", "電子一甲"),
    ("0014", "微積分(一)", "Teacher 7", 4, "必修", 100, 100, "1;3;5", "1,2;7,8;9,10", "中文", "數學一甲"),
    ("0015", "職場英文"   , "Teacher 2", 3, "選修", 40, 40, "2;4;5", "1;6,7,8;3,4", "英文", "外文一甲"),

    ("0016", "會計學(一)", "Teacher 3", 3, "必修", 50, 50, "3", "6,7,8", "中文", "會計一甲"),
    ("0017", "會計學(二)", "Teacher 3", 3, "必修", 50, 50, "4", "2,3,4", "中文", "會計二甲"),
    ("0018", "管理學", "Teacher 4", 3, "選修", 70, 70, "3;4", "3,4;9,10", "中文", "會計二甲"),
    ("0019", "會計學(二)", "Teacher 3", 3, "必修", 50, 50, "4", "6,7,8", "中文", "會計二乙"),

    ("0020", "企業管理", "Teacher 14", 3, "選修", 70, 70, "1;5", "9,10;3,4", "中文", "商管一甲"),
    ("0021", "越少人越好", "No Teacher", 1, "選修", 1, 1, "1", "1", "中文", "資訊二甲"),
]




if __name__ == "__main__":
    con = sqlite3.connect("instance/database.db")
    cur = con.cursor()
    cur.executemany("INSERT INTO courses VALUES(?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)", predefine_courses)
    con.commit()